<a href="https://colab.research.google.com/github/doglasborges/Kaggle_Titanic/blob/main/Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [7]:
import pandas as pd

test = "https://raw.githubusercontent.com/doglasborges/Kaggle_Titanic/main/test.csv?token=ANWXCDNM5UAYH5N4V6OU6KTBV2FPA"
df_test = pd.read_csv(test)

train = "https://raw.githubusercontent.com/doglasborges/Kaggle_Titanic/main/train.csv?token=ANWXCDLS7OILJPE2H5TOKBTBV2FUG"
df_train = pd.read_csv(train)

In [8]:
df_train.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

# Nova seção